[
  {
    "date": "0000-00-00",
    "contents": [
      {
        "value": "",
        "type": "title"
      },
      {
        "value": "",
        "type": "subtitle"
      },
      {
        "value": "",
        "type": "text"
      },
      {
        "value": "",
        "type": "caption"
      }
    ]
  },
  {
    "date": "2021-05-24",
    "contents": [
      {
        "value": "Projects and Fix for mobile",
        "type": "title"
      },
      {
        "value": "The projects",
        "type": "subtitle"
      },
      {
        "value": "I added the menu \"Projects\" to share info about my personal projects, but instead of rewrite things already visible on the README.md, i decided to fetch the info directly from Github.",
        "type": "text"
      },
      {
        "value": "The second advantage is that i will not have to update the info on this website if there are new things. \\o/",
        "type": "text"
      },
      {
        "value": "Note: Only two projects for the moment. One or two more will come later after an update on their README file.",
        "type": "caption"
      },
      {
        "value": "Fix issues on mobile",
        "type": "subtitle"
      },
      {
        "value": "I didn't do some tests on mobile since few days and of course it was not optimized. Now that will be better (until the next check).",
        "type": "text"
      }
    ]
  },
  {
    "date": "2021-05-21",
    "contents": [
      {
        "value": "Cosmetic changes in code",
        "type": "title"
      },
      {
        "value": "I reorganize the code a little bit to not mix common components, pages and layout. That will be more easier to find a piece of code.",
        "type": "text"
      },
      {
        "value": "I change also the imports to use absolute path instead of relative path. That will help to understand from where come the imported code.",
        "type": "text"
      }
    ]
  },
  {
    "date": "2021-05-21",
    "contents": [
      {
        "value": "The website is online",
        "type": "title"
      },
      {
        "value": "I switch on the access to the website even if all is not finished. let's see later if it's a good idea or not. ",
        "type": "text"
      },
      {
        "value": "I can always move back to the \"under construction page\" later if needed (maybe i will create a github action to switch on/off that).",
        "type": "text"
      },
      {
        "value": "React-router integration",
        "type": "title"
      },
      {
        "value": "I decided to integrate react-router on the site and seems i waited too lot to do that. ",
        "type": "text"
      },
      {
        "value": "I had to refactor lot of things but the result is better than expected",
        "type": "text"
      }
    ]
  },
  {
    "date": "2021-05-18",
    "contents": [
      {
        "value": "Changes on the home page",
        "type": "title"
      },
      {
        "value": "As mentionned last time, I added two new things on the main page (a quick overview of the logbook and my github activities with the account 'Noofreuuuh')",
        "type": "text"
      },
      {
        "value": "Like each time this is a first version, improvement will come later. I just need to know if i will keep those two things there or not",
        "type": "text"
      }
    ]
  },
  {
    "date": "2021-05-17",
    "contents": [
      {
        "value": "About the logbook",
        "type": "title"
      },
      {
        "value": "I moved the content in a JSON file. That will reduce the number of lines in the TSX and i don't want to have to manage a database for that with CRUD,...",
        "type": "text"
      },
      {
        "value": "I worked a little bit on the ui. no big changes but a little bit less ugly.",
        "type": "text"
      },
      {
        "value": "New ideas",
        "type": "title"
      },
      {
        "value": "1- Create a section to publish some short articles",
        "type": "subtitle"
      },
      {
        "value": "It comes after reading an article about linked list.",
        "type": "text"
      },
      {
        "value": "I think that write article can help me to more understood concept or new things.",
        "type": "text"
      },
      {
        "value": "Let's try that later.",
        "type": "text"
      },
      {
        "value": "2- Create a component to display github activities",
        "type": "subtitle"
      },
      {
        "value": "Create a component to display github activities on the home page.",
        "type": "text"
      },
      {
        "value": "hint: https://api.github.com/users/Noofreuuuh/events",
        "type": "caption"
      }
    ]
  },
  {
    "date": "2021-05-15",
    "contents": [
      {
        "value": "Add a logbook?? Why??",
        "type": "title"
      },
      {
        "value": "It might not be something original but, today, after working on this site playing with Material-ui, I decided to create this page.",
        "type": "text"
      },
      {
        "value": "The idea is simple.",
        "type": "text"
      },
      {
        "value": "Write a few words regularly about what I did, learned or discovered during the day or, if I am not doing it daily, the last few days.",
        "type": "text"
      },
      {
        "value": "Note 1: The current version of the logbook is ugly. Need to rethink it later",
        "type": "caption"
      },
      {
        "value": "Note 2: Same for the background page.",
        "type": "caption"
      },
      {
        "value": "Note 3: More globally, need to work on the theme.",
        "type": "caption"
      }
    ]
  }
]
